
<!-- header -->
```fish
plan -chdir=tf/dev/vpc -lock=false
```
<!-- fmt -->

<!-- outline -->
<details><summary>Outline of changes.</summary>

```diff
+ aws_instance.a4l_bastion will be created
+ aws_instance.a4l_internal will be created
+ aws_key_pair.a4l will be created
```
</details>
<!-- main -->
<details><summary>Plan: 3 to add, 0 to change, 0 to destroy.</br>

###### OpenTofu CI by @chris3ware via [pull_request](https://github.com/3ware/aws-network-speciality/actions/runs/10824550121/job/30031991533) at 2024-09-12T05:09:38Z.
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_instance.a4l_bastion will be created
  + resource "aws_instance" "a4l_bastion" {
      + ami                                  = "ami-033b95fb8079dc481"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "A4L"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-02a6249779b2bd437"
      + tags                                 = {
          + "Name" = "A4L-BASTION"
        }
      + tags_all                             = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "A4L-BASTION"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-04ea9b7bdaf566d56",
        ]
    }

  # aws_instance.a4l_internal will be created
  + resource "aws_instance" "a4l_internal" {
      + ami                                  = "ami-033b95fb8079dc481"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "A4L"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-013e1423f2a02b0bc"
      + tags                                 = {
          + "Name" = "A4L-INTERNAL-TEST"
        }
      + tags_all                             = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
          + "Name"                  = "A4L-INTERNAL-TEST"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0711942709dc6dae0",
        ]
    }

  # aws_key_pair.a4l will be created
  + resource "aws_key_pair" "a4l" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "A4L"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMNSplDEGibL7tUs87JsuwnHmDA2uSB+M2kUlOQuI0Fc"
      + tags_all        = {
          + "3ware:environment"     = "dev"
          + "3ware:managed-by-tofu" = "true"
          + "3ware:project-id"      = "aws-network-speciality"
          + "3ware:service"         = "vpc"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_hostname = (known after apply)
  + internal_host_ip = (known after apply)

```
</details>
<!-- footer -->
<!-- tofu.36.-chdir-tf-dev-vpc.-out-tfplan -->